In [1]:
import pandas as pd
import numpy as np
import sklearn as sk
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report, confusion_matrix
from sklearn import preprocessing as pp
from imblearn.over_sampling import SMOTE
from imblearn.under_sampling import NearMiss
from sklearn.model_selection import GridSearchCV
import pickle
import sqlite3

In [ ]:

cols = ["nationality", "age", "gender", 'topcity', "continent", "food_one", "food_two", "food_three", "food_four",
        "amusement_park", "art_gallery", "aqarium", 'library', "movie_theater", "museum", 'shop', "natural_feature",
        "park", 'place_of_worship', 'zoo', "favorite_city_0", "favorite_city_1", "favorite_city_2"]

vals = ["America", '25-40', 'Female', 'Accra', 'Europe', '2', '3', '4', '4', '3', '2', '2', '1', '1', '2',
       '3', '4', '3', '4', '4', 'Accra', 'Bangkok', 'London']



dictt = dict(zip(cols, vals))
dictt

In [ ]:
test = pd.DataFrame(dictt, index=[0])

In [ ]:
test

In [ ]:
def get_df(table_name):
    try:
        conn = sqlite3.connect('/Users/tristannisbet/Documents/travel_app/places.db')

    except Exception as e:
        print('Error durring connection: ', str(e))
    
    sql = """select * from {}""".format(table_name)
    df = pd.read_sql_query(sql, conn)

    return df

In [ ]:

survey = get_df('survey_response')

In [ ]:
survey.shape

In [ ]:

survey.columns

In [ ]:
test.columns

In [ ]:
test.shape

In [2]:
cols = ['user', 'city', 'city_id', 'continent', 'food_sim', 'sum', 'rank']

values1 = ['0', 'Porto', '102', 'Europe', 12.3222, 123.44, 0]
values2 = ['0', 'Bangkok', '107', 'Europe', 98.34, 63.44, 0]
values2 = ['0', 'London', '112', 'Europe', 32.543, 58.22, 0]

In [3]:

df = pd.DataFrame(np.array([['0', 'Porto', '102', 'Europe', 12.3222, 123.44, 0], ['0', 'Bangkok', '107', 'Europe', 98.34, 63.44, 0],
                           ['0', 'London', '112', 'Europe', 32.543, 58.22, 0]]),
                   columns=cols)

In [7]:

df

                     continent food_sim     sum rank
user city    city_id
0    Porto   102        Europe  12.3222  123.44    0
     Bangkok 107        Europe    98.34   63.44    0
     London  112        Europe   32.543   58.22    0

In [6]:
df.set_index(['user', 'city', 'city_id'], inplace=True)

In [18]:
df.index[2][1]

'London'